class Compute_AB
{
    int[] A,B;
    public Compute_AB(int A1[], int B1[])
    {
        //  請把程式寫在下列  //***********//  之間
        //******************************************************************//
        A = A1;
        B = B1;
        //******************************************************************//
    }
    String judge()
    {
        String ans1;

        //  請把程式寫在下列  //***********//  之間, 計算出幾A幾B,並回傳
        //******************************************************************//
        int a=0,b=0;
        for(int i=0; i<A.length; i++)
        {
            for(int j=0; j<B.length; j++)
            {
                if(A[i] == B[j])
                {
                    if (i == j) a++;
                    else b++;
                }
            }
        }
        ans1 = (char)(a+'0') + "A" + (char)(b+'0') + "B";

        //******************************************************************//

        return ans1;  //計算出幾A幾B,並回傳
    }

    void show_AB()
    {
        //  請把程式寫在下列  //***********//  之間, 顯示A,B兩陣列之內容
        //******************************************************************//
        System.out.print("A[] = ");
        for(int i=0; i<A.length; i++)
        {
            System.out.print(A[i]+" ");
        }

        System.out.print("B[] = ");
        for(int i=0; i<B.length; i++)
        {
            System.out.print(B[i]+" ");
        }
        //******************************************************************//
    }


}
